// 1.Создайте страницу, которая спрашивает имя и выводит его.
// var yourName = prompt('What is your name?');
//alert(yourName);


// 2. Выведется ли alert?
//if ("0") {
//  alert( 'Привет' );
//} // да, так как это НЕ ПУСТАЯ строка

// 3.
//var nameJS = prompt('Каково "официальное" название JavaScript?');
//if (nameJS == 'ECMAScript') {
//    alert('Верно!');
//} else {
//    alert('Не знаете? ECMAScript!');
//}

// 4. Используя конструкцию if..else, напишите код, который получает значение prompt, а затем выводит alert:
//var yourNumber = prompt('Введите число');
//if (yourNumber > 0) {
//    alert('1, если значение больше нуля');
//} if (yourNumber < 0) {
//    alert('-1, если значение меньше нуля');
//} else {
//    alert('0, если значение равно нулю');
//}


// 5. Проверка логина
//var nameAdmin = prompt('Кто пришел?');
//if (nameAdmin = 'Админ') {
//    alert('Верно!');
//
//   var passAdmin = prompt('Введите пароль')
//   
//   if (passAdmin = 'Чёрный Властелин') {
//      alert('Добро пожаловать!')
//   } else if (passAdmin = '') {
//      alert('Неверный пароль')
//   } else {
//       alert('Вход отменен')
//   }
//}
//else if (nameAdmin = '') {
//    alert('Вход отменен!');
//} else {
//    alert('Я вас не знаю');
//}


// 6. Перепишите if с использованием оператора '?':
 
//if (a + b < 4) {
//  result = 'Мало';
//} else {
//  result = 'Много';
//}
//result = (a + b < 4) ? 'Мало' : 'Много';
//

// 7.Перепишите if..else с использованием нескольких операторов '?'.

//var message = (login == 'Вася') ? 'Привет' :
//  (login == 'Директор') ? 'Здравствуйте' :
//  (login == '') ? 'Нет логина' : '';